### Python Library for data analysis

High Performance containers for data analysis

Datastructures with lot of functionality

1. Meaningful labels
2. Time series functionality
3. Handling missing data
4. Relational Operations

### Import a file as a DataFrame

In [124]:
import pandas as pd
data=pd.read_csv("census.csv")
type(data)

pandas.core.frame.DataFrame

### Find the shape : No of rows and No of columns

In [125]:
data.shape

(45222, 14)

### Find the column labels

In [126]:
data.columns

Index(['age', 'workclass', 'education_level', 'education-num',
       'marital-status', 'occupation', 'relationship', 'race', 'sex',
       'capital-gain', 'capital-loss', 'hours-per-week', 'native-country',
       'income'],
      dtype='object')

In [127]:
data.index

RangeIndex(start=0, stop=45222, step=1)

In [128]:
type(data.columns)

pandas.core.indexes.base.Index

### Find the range of entries

In [129]:
data.index

RangeIndex(start=0, stop=45222, step=1)

In [130]:
type(data.index)

pandas.core.indexes.range.RangeIndex

### Extract certain rows

## iloc

In [131]:
data.iloc[0,0]

39

#### First 5 columns

In [132]:
data.iloc[:5,:]

,age,workclass,education_level,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,State-gov,Bachelors,13.0,Never-married,Adm-clerical,Not-in-family,White,Male,2174.0,0.0,40.0,United-States,<=50K
1,50,Self-emp-not-inc,Bachelors,13.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,0.0,0.0,13.0,United-States,<=50K
2,38,Private,HS-grad,9.0,Divorced,Handlers-cleaners,Not-in-family,White,Male,0.0,0.0,40.0,United-States,<=50K
3,53,Private,11th,7.0,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0.0,0.0,40.0,United-States,<=50K
4,28,Private,Bachelors,13.0,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0.0,0.0,40.0,Cuba,<=50K

In [133]:
data.iloc[:5,:2]

   age          workclass
0   39          State-gov
1   50   Self-emp-not-inc
2   38            Private
3   53            Private
4   28            Private

#### Last 5 Columns

In [134]:
data.iloc[-5:,:]

,age,workclass,education_level,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
45217,33,Private,Bachelors,13.0,Never-married,Prof-specialty,Own-child,White,Male,0.0,0.0,40.0,United-States,<=50K
45218,39,Private,Bachelors,13.0,Divorced,Prof-specialty,Not-in-family,White,Female,0.0,0.0,36.0,United-States,<=50K
45219,38,Private,Bachelors,13.0,Married-civ-spouse,Prof-specialty,Husband,White,Male,0.0,0.0,50.0,United-States,<=50K
45220,44,Private,Bachelors,13.0,Divorced,Adm-clerical,Own-child,Asian-Pac-Islander,Male,5455.0,0.0,40.0,United-States,<=50K
45221,35,Self-emp-inc,Bachelors,13.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,0.0,0.0,60.0,United-States,>50K

## Head

In [135]:
data.head(2)

,age,workclass,education_level,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,State-gov,Bachelors,13.0,Never-married,Adm-clerical,Not-in-family,White,Male,2174.0,0.0,40.0,United-States,<=50K
1,50,Self-emp-not-inc,Bachelors,13.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,0.0,0.0,13.0,United-States,<=50K

## Tail - Last 5 rows

In [136]:
data.tail()

,age,workclass,education_level,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
45217,33,Private,Bachelors,13.0,Never-married,Prof-specialty,Own-child,White,Male,0.0,0.0,40.0,United-States,<=50K
45218,39,Private,Bachelors,13.0,Divorced,Prof-specialty,Not-in-family,White,Female,0.0,0.0,36.0,United-States,<=50K
45219,38,Private,Bachelors,13.0,Married-civ-spouse,Prof-specialty,Husband,White,Male,0.0,0.0,50.0,United-States,<=50K
45220,44,Private,Bachelors,13.0,Divorced,Adm-clerical,Own-child,Asian-Pac-Islander,Male,5455.0,0.0,40.0,United-States,<=50K
45221,35,Self-emp-inc,Bachelors,13.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,0.0,0.0,60.0,United-States,>50K

### Useful Info

In [137]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45222 entries, 0 to 45221
Data columns (total 14 columns):
age                45222 non-null int64
workclass          45222 non-null object
education_level    45222 non-null object
education-num      45222 non-null float64
marital-status     45222 non-null object
occupation         45222 non-null object
relationship       45222 non-null object
race               45222 non-null object
sex                45222 non-null object
capital-gain       45222 non-null float64
capital-loss       45222 non-null float64
hours-per-week     45222 non-null float64
native-country     45222 non-null object
income             45222 non-null object
dtypes: float64(4), int64(1), object(9)
memory usage: 4.8+ MB

### Modify values

In [138]:
import numpy as np
data.iloc[:, -1]=np.nan
data.head(10)

,age,workclass,education_level,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,State-gov,Bachelors,13.0,Never-married,Adm-clerical,Not-in-family,White,Male,2174.0,0.0,40.0,United-States,NaN
1,50,Self-emp-not-inc,Bachelors,13.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,0.0,0.0,13.0,United-States,NaN
2,38,Private,HS-grad,9.0,Divorced,Handlers-cleaners,Not-in-family,White,Male,0.0,0.0,40.0,United-States,NaN
3,53,Private,11th,7.0,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0.0,0.0,40.0,United-States,NaN
4,28,Private,Bachelors,13.0,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0.0,0.0,40.0,Cuba,NaN
5,37,Private,Masters,14.0,Married-civ-spouse,Exec-managerial,Wife,White,Female,0.0,0.0,40.0,United-States,NaN
6,49,Private,9th,5.0,Married-spouse-absent,Other-service,Not-in-family,Black,Female,0.0,0.0,16.0,Jamaica,NaN
7,52,Self-emp-not-inc,HS-grad,9.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,0.0,0.0,45.0,United-States,NaN
8,31,Private,Masters,14.0,Never-married,Prof-specialty,Not-in-family,White,Female,14084.0,0.0,50.0,United-States,NaN
9,42,Private,Bachelors,13.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,5178.0,0.0,40.0,United-States,NaN

### Extract Certain Coulmns

In [141]:
col_age=data['age']
print(type(col_age))
print(col_age[:5])

<class 'pandas.core.series.Series'>
0    39
1    50
2    38
3    53
4    28
Name: age, dtype: int64

In [142]:
col_age.head()

0    39
1    50
2    38
3    53
4    28
Name: age, dtype: int64

### Column values in to a NumPy array --  column_name.values

In [143]:
ndarray = col_age.values
print(ndarray)
print(type(ndarray))

[39 50 38 ... 38 44 35]
<class 'numpy.ndarray'>

### Building Data Frames

### Read CSV -- pd.read_csv('filename')

In [144]:
data = pd.read_csv('census.csv')

In [145]:
print(data.head(1))

   age   workclass education_level  education-num  marital-status  \
0   39   State-gov       Bachelors           13.0   Never-married

      occupation    relationship    race    sex  capital-gain  capital-loss  \
0   Adm-clerical   Not-in-family   White   Male        2174.0           0.0

   hours-per-week  native-country income
0            40.0   United-States  <=50K

### Read dict --  pd.DataFrame(dict_name)

In [146]:
dict_x = {'day':['sun','sun','mon','mon'], 'city':['san jose','santa clara','san jose','santa clara'],
          'visitors':[100,200,50,80]}
data_x = pd.DataFrame(dict_x)
print(data_x)

   day         city  visitors
0  sun     san jose       100
1  sun  santa clara       200
2  mon     san jose        50
3  mon  santa clara        80

### Read list -- Covert list in to a dict and then DataFrame

In [147]:
cities=['san jose','santa clara','san jose','santa clara']
days = ['sun','sun','mon','mon']
visitors = [100,200,50,80]
list_labels = ['city','weekday','visitors']      # col labels
list_cols = [cities, days,visitors]      # column entries or list of lists
zipped = list(zip(list_labels, list_cols))
data_y=dict(zipped)         # converts zipped into a dict
data_x=pd.DataFrame(data_y)   #convert a dictionary into a dataframe
print(data_x)

          city weekday  visitors
0     san jose     sun       100
1  santa clara     sun       200
2     san jose     mon        50
3  santa clara     mon        80

### Broadcasting assigning values to a column

#### Crreate a column and assign value

In [148]:
cities=['san jose','santa clara','san jose','santa clara']
days = ['sun','sun','mon','mon']
visitors = [100,200,50,80]
list_labels = ['city','weekday','visitors']      # col labels
list_cols = [cities, days,visitors]      # column entries or list of lists
zipped = list(zip(list_labels, list_cols))
data_y=dict(zipped)         # converts zipped into a dict
data_x=pd.DataFrame(data_y)   #convert a dictionary into a dataframe
print(data_x)


data_x['fees']=0     # creates a column fees and broadcasts 0 to the entire column
print(data_x)

          city weekday  visitors
0     san jose     sun       100
1  santa clara     sun       200
2     san jose     mon        50
3  santa clara     mon        80
          city weekday  visitors  fees
0     san jose     sun       100     0
1  santa clara     sun       200     0
2     san jose     mon        50     0
3  santa clara     mon        80     0

#### Assign Values to a column

In [149]:
data_x['fees']=[1,1,2,2]
print(data_x)

          city weekday  visitors  fees
0     san jose     sun       100     1
1  santa clara     sun       200     1
2     san jose     mon        50     2
3  santa clara     mon        80     2

#### Broadcasting in a dict

In [150]:
height = [5.5,6,5,6.1,5.3]
dict_x={ 'heights': height, 'sex': 'm'}    # m is assigned for all entries
data_x=pd.DataFrame(dict_x)
print(data_x)

   heights sex
0      5.5   m
1      6.0   m
2      5.0   m
3      6.1   m
4      5.3   m

### Changing Column and Index Labels

In [153]:
height = [5.5,6,5,6.1,5.3]
dict_x={ 'heights': height, 'sex': 'm'}    # m is assigned for all entries
data_x=pd.DataFrame(dict_x)
print(data_x)



data_x.columns = ['height (ft)', 'sex']       # assign new column names
data_x.index = [1,2,3,4,5]                    # assign new row index
print('Data Frame after changing names')
print(data_x)

   heights sex
0      5.5   m
1      6.0   m
2      5.0   m
3      6.1   m
4      5.3   m
Data Frame after changing names
   height (ft) sex
1          5.5   m
2          6.0   m
3          5.0   m
4          6.1   m
5          5.3   m

### Importing and Exporting Data